СЦ_Мобильное/src/Enums/ТипыПодписчиковУведомлений/ТипыПодписчиковУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодписчиковУведомлений</name>
  <enumValues>
    <name>APNS</name>
  </enumValues>
  <enumValues>
    <name>GCM</name>
  </enumValues>
</mdclass:Enum>

СЦ_Мобильное/src/CommonModules/ОбщегоНазначения/Module.bsl
Функция ПолучитьИнтервалАвтоматическогоОбменаДанными() Экспорт
	Возврат Константы.ИнтервалАвтоматическогоОбменаДанными.Получить();
КонецФункции	

Процедура УстановитьIDПриложения(ID) Экспорт
	Константы.ИдентификаторИнформационнойБазы.Установить(ID.ИдентификаторИнформационнойБазы);
	Константы.ИдентификаторПриложения.Установить(ID.ИдентификаторПриложения);
	Константы.ИдентификаторУстройства.Установить(ID.ИдентификаторУстройства);
	Если ID.ТипПодписчика = ТипПодписчикаДоставляемыхУведомлений.APNS Тогда
		Константы.ТипПодписчика.Установить(Перечисления.ТипыПодписчиковУведомлений.APNS);
	ИначеЕсли ID.ТипПодписчика = ТипПодписчикаДоставляемыхУведомлений.GCM Тогда
		Константы.ТипПодписчика.Установить(Перечисления.ТипыПодписчиковУведомлений.GCM);
	КонецеСли;	
КонецПроцедуры
